       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 X-P1          PIC 9(1) VALUE 1 @USAGE@.
       01 X-P2          PIC 9(2) VALUE 12 @USAGE@.
       01 X-P3          PIC 9(3) VALUE 123 @USAGE@.
       01 X-P4          PIC 9(4) VALUE 1234 @USAGE@.
       01 X-P5          PIC 9(5) VALUE 12345 @USAGE@.
       01 X-P6          PIC 9(6) VALUE 123456 @USAGE@.
       01 X-P7          PIC 9(7) VALUE 1234567 @USAGE@.
       01 X-P8          PIC 9(8) VALUE 12345678 @USAGE@.
       01 X-P9          PIC 9(9) VALUE 123456789 @USAGE@.
       01 X-P10         PIC 9(10) VALUE 1234567890 @USAGE@.
       01 X-P11         PIC 9(11) VALUE 12345678901 @USAGE@.
       01 X-P12         PIC 9(12) VALUE 123456789012 @USAGE@.
       01 X-P13         PIC 9(13) VALUE 1234567890123 @USAGE@.
       01 X-P14         PIC 9(14) VALUE 12345678901234 @USAGE@.
       01 X-P15         PIC 9(15) VALUE 123456789012345 @USAGE@.
       01 X-P16         PIC 9(16) VALUE 1234567890123456 @USAGE@.
       01 X-P17         PIC 9(17) VALUE 12345678901234567 @USAGE@.
       01 X-P18         PIC 9(18) VALUE 123456789012345678 @USAGE@.
       01 X-N1          PIC S9(1) VALUE -1 @USAGE@.
       01 X-N2          PIC S9(2) VALUE -12 @USAGE@.
       01 X-N3          PIC S9(3) VALUE -123 @USAGE@.
       01 X-N4          PIC S9(4) VALUE -1234 @USAGE@.
       01 X-N5          PIC S9(5) VALUE -12345 @USAGE@.
       01 X-N6          PIC S9(6) VALUE -123456 @USAGE@.
       01 X-N7          PIC S9(7) VALUE -1234567 @USAGE@.
       01 X-N8          PIC S9(8) VALUE -12345678 @USAGE@.
       01 X-N9          PIC S9(9) VALUE -123456789 @USAGE@.
       01 X-N10         PIC S9(10) VALUE -1234567890 @USAGE@.
       01 X-N11         PIC S9(11) VALUE -12345678901 @USAGE@.
       01 X-N12         PIC S9(12) VALUE -123456789012 @USAGE@.
       01 X-N13         PIC S9(13) VALUE -1234567890123 @USAGE@.
       01 X-N14         PIC S9(14) VALUE -12345678901234 @USAGE@.
       01 X-N15         PIC S9(15) VALUE -123456789012345 @USAGE@.
       01 X-N16         PIC S9(16) VALUE -1234567890123456 @USAGE@.
       01 X-N17         PIC S9(17) VALUE -12345678901234567 @USAGE@.
       01 X-N18         PIC S9(18) VALUE -123456789012345678 @USAGE@.
       PROCEDURE        DIVISION.
           DISPLAY X-P1.
           DISPLAY X-P2.
           DISPLAY X-P3.
           DISPLAY X-P4.
           DISPLAY X-P5.
           DISPLAY X-P6.
           DISPLAY X-P7.
           DISPLAY X-P8.
           DISPLAY X-P9.
           DISPLAY X-P10.
           DISPLAY X-P11.
           DISPLAY X-P12.
           DISPLAY X-P13.
           DISPLAY X-P14.
           DISPLAY X-P15.
           DISPLAY X-P16.
           DISPLAY X-P17.
           DISPLAY X-P18.
           DISPLAY X-N1.
           DISPLAY X-N2.
           DISPLAY X-N3.
           DISPLAY X-N4.
           DISPLAY X-N5.
           DISPLAY X-N6.
           DISPLAY X-N7.
           DISPLAY X-N8.
           DISPLAY X-N9.
           DISPLAY X-N10.
           DISPLAY X-N11.
           DISPLAY X-N12.
           DISPLAY X-N13.
           DISPLAY X-N14.
           DISPLAY X-N15.
           DISPLAY X-N16.
           DISPLAY X-N17.
           DISPLAY X-N18.
           STOP RUN.
